Revit 2027 API
BuiltInFailures.DimensionFailures.SpotSlopeReferencePointIsSingular Property
 The highlighted Spot Slope references an element point that is singular.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SpotSlopeReferencePointIsSingular { get; }
Public Shared ReadOnly Property SpotSlopeReferencePointIsSingular As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SpotSlopeReferencePointIsSingular {
	FailureDefinitionId^ get ();
}
static member SpotSlopeReferencePointIsSingular : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace